export interface BookDecorationQuiz {
    chapter: number;
    desc: string;
    answer: string | string[];
    type: BookDecorationQuizType;
    id: number;
}

export enum BookDecorationQuizType {
    FillBlack
}

export const BookDecorationQuizs: BookDecorationQuiz[] = [
    ...[
        {
            desc: '格式塔心理学认为在日常生活中，人们的头脑不断地组成$。',
            answer: '整体的形'
        },
        {
            desc: '书籍的价值最后才能得以实现是需要通过$。',
            answer: '市场行为'
        },
        {
            desc: '卷轴装的书中，轴是用以$。',
            answer: '旋转书卷的'
        },
        {
            desc: '用皮绳编的简策装叫$。',
            answer: '韦编'
        },
        {
            desc: '人眼的视觉范围水平视角，单眼为$。',
            answer: '128～148°'
        },
        {
            desc: '竹片做成的书称作$。',
            answer: '简策'
        },
        {
            desc: '书籍设计中一般是把书名作为$。',
            answer: '近景'
        },
        {
            desc: '帛书收藏时按$从左到右$。',
            answer: ['中心棒', '卷成一束']
        },
        {
            desc: '对儿童来说，他们的构图方式是$。',
            answer: '平列式的'
        },
        {
            desc: '概念书籍可以脱离书籍模式的约束，甚至彻底脱离$。',
            answer: '纸张'
        },
        {
            desc: '期刊每期封面上都必须固定下来的有$、设计风格$。',
            answer: ['字体', '色彩']
        },
        {
            desc: '既是书籍的立体部分，也是读者视觉接触时间最长的是$。',
            answer: '正文'
        },
        {
            desc: '春秋战国时期，石鼓文字继承了西周$。',
            answer: '金文的特点'
        },
        {
            desc: '杂志的志指记载的文字或文字$。',
            answer: '记事'
        },
        {
            desc: '文字是从$演变而来的。',
            answer: '图形'
        },
        {
            desc: '在为儿童设计书籍时，必须充分认识儿童的$和童趣。',
            answer: '绘画心理'
        },
        {
            desc: '包背装折好的书页依顺序排好，向右而集成$。',
            answer: '书脊'
        },
        {
            desc: '书籍设计是以一本书为对象，对其进行有美感的$创造。',
            answer: '视觉'
        },
        {
            desc: '我国最早的册页蝴蝶装盛行于宋代，特点是$印刷一版一页。',
            answer: '单面'
        },
        {
            desc: '概念书籍不受条条框框的制约，在创意上注重$的探索。',
            answer: '纯艺术'
        },
        {
            desc: '方背精装又称$精装。',
            answer: '平背'
        },
        {
            desc: '书籍应以传播知识、介绍经验为目的，并用$表现在$上。',
            answer: ['文字', '材料']
        },
        {
            desc: '期刊又名$，杂志又名$。',
            answer: ['杂志', '期刊']
        },
        {
            desc: '在文字未产生以前，人们靠$相互沟通。',
            answer: '语言'
        },
    ].map((item) => ({ ...item, chapter: 0, type: BookDecorationQuizType.FillBlack })),

    ...[
        {
            desc: '书的通常意义的载体为$。',
            answer: '纸'
        },
        {
            desc: '现在我们有许多书画装裱形式，就是借鉴了古代的$。',
            answer: '卷轴装'
        },
        {
            desc: '用来区分纸张的薄厚的是$。',
            answer: '克'
        },
        {
            desc: '经折装从外形上看，它近似于后来的$。',
            answer: '册页书籍'
        },
        {
            desc: '概念书籍中文字在传达信息的同时，仍然起着图形的$。',
            answer: '装饰作用'
        },
        {
            desc: '就科技书设计而言，主要手段应是$。',
            answer: '抽象'
        },
        {
            desc: '木片做成的书称$。',
            answer: '版牍'
        },
        {
            desc: '卷轴装的书籍形态在经过旋风装和经折装后逐渐向$。',
            answer: '册页装演变'
        },
        {
            desc: '为了阅读的方便和保护读者视力，排式也得符合$。',
            answer: '人体工程学'
        },
        {
            desc: '书籍设计就是以一本书为对象，对其进行有美感的$。',
            answer: '视觉创造'
        },
        {
            desc: '格式塔心理学强调整体不存在$。',
            answer: '元素之中'
        },
        {
            desc: '出版策划应该是出版物的$。',
            answer: '整体形象设计'
        },
        {
            desc: '旋风装又名$。',
            answer: '龙鳞装'
        },
        {
            desc: '杂志又名$。',
            answer: '期刊'
        },
        {
            desc: '出版策划应该是出版物的整体$设计。',
            answer: '形象'
        },
        {
            desc: '格式塔心理学强调整体存在$中。',
            answer: '关系'
        },
        {
            desc: '所谓$是指一本书的幅面大小。',
            answer: '开本'
        },
        {
            desc: '书作为传递文字信息的物质载体，设计者在为一本书作设计前，首先考虑的就是$。',
            answer: '容字量'
        },
        {
            desc: '文字画图形经过改良演进，逐渐成为定型的$文字。',
            answer: '象形'
        },
        {
            desc: '在书籍的审美活动中，人与书的关系是$的。',
            answer: '动态'
        },
        {
            desc: '插图以$艺术的多种形式为表现手段。',
            answer: '造型'
        },
        {
            desc: '卷轴装始于$。',
            answer: '帛书'
        },
        {
            desc: '线装书在$方面与包背装没有差异。',
            answer: '折页'
        },
        {
            desc: '期刊每期封面上都必须固定下来的有设计风格、$',
            answer: '字体'
        }
    ].map((item) => ({ ...item, chapter: 1, type: BookDecorationQuizType.FillBlack })),

    ...[
        {
            desc: '格式塔心理学是现代欧美$心理学派。',
            answer: '完形'
        },
        {
            desc: '卷轴装的书，主要四个部分是卷、襟、轴、$。',
            answer: '带'
        },
        {
            desc: '图书只有被读者翻阅时才构成$。',
            answer: '四维空间'
        },
        {
            desc: '卷轴装始于$。',
            answer: '帛书'
        },
        {
            desc: '书籍通过装订后成为一个$。',
            answer: '六面体'
        },
        {
            desc: '在南宋时期完全取代蝴蝶装而广泛应用的是$。',
            answer: '包背装'
        },
        {
            desc: '从设计风格上来说，内封的设计更趋于$。',
            answer: '简洁'
        },
        {
            desc: '从图形演变而来的是$。',
            answer: '文字'
        },
        {
            desc: '16开本的尺寸为$。',
            answer: '184×260mm'
        },
        {
            desc: '文字画图形经过改良演进，逐渐成为定型的$',
            answer: '象形文字'
        },
        {
            desc: '我国历史上使用最久的书籍的形态是$。',
            answer: '卷轴装'
        },
        {
            desc: '由于期刊是定期出版的，因此有一定的$。',
            answer: '连续性'
        },
        {
            desc: '经折装这种装订形式已完全脱离$。',
            answer: '卷轴'
        },
        {
            desc: '蝴蝶装优点是便于一版内刊载$。',
            answer: '整幅图画'
        },
        {
            desc: '帛书收藏时按$从左到右卷成一束。',
            answer: '中心棒'
        },
        {
            desc: '平装书被认为由传统的$演变而来。',
            answer: '包背装'
        },
        {
            desc: '卷轴装的书，主要四个部分是卷、轴、带、$。',
            answer: '襟'
        },
        {
            desc: '儿童对形象的认识，就是对$经验的认识。',
            answer: '感性'
        },
        {
            desc: '书籍是商品，书籍设计就有必要引进其他商业设计的$语言。',
            answer: '广告'
        },
        {
            desc: '锁线订又称$。',
            answer: '串订'
        },
        {
            desc: '书的通常意义的载体为$。',
            answer: '纸'
        },
        {
            desc: '儿童在绘画时常将物体内部剖开，呈现透明状，这是儿童图像思维的$形式。',
            answer: '外化'
        },
        {
            desc: '九百年前，中国发明了$术。',
            answer: '活字印刷'
        },
        {
            desc: '大约在一千三百年前，中国发明了$印刷术。',
            answer: '雕版'
        },
        {
            desc: '函套、外包装等独特造型营造出的气氛，往往能提高精品书$的品味。',
            answer: '文化'
        }
    ].map((item) => ({ ...item, chapter: 2, type: BookDecorationQuizType.FillBlack })),

    ...[
        {
            desc: '不论何种期刊，它的时间性决定了每一期都有一定的连续性和$。',
            answer: '统一性'
        },
        {
            desc: '所有的视觉艺术都讲究黑、白、灰关系，即$。',
            answer: '调子'
        },
        {
            desc: '在殷商和西周早期，人们将占卜卜辞刻写上的是$',
            answer: '龟甲兽骨'
        },
        {
            desc: '期刊同书籍一样也是要通过销售才能体现其$。',
            answer: '价值'
        },
        {
            desc: '按一般的阅读习惯，是先看位于文章之首的标题，再看$。',
            answer: '正文'
        },
        {
            desc: '我国最常用的平板纸幅面尺寸是787×1092mm和$。',
            answer: '889×1194mm'
        },
        {
            desc: '儿童的想象力极为丰富，为儿童书籍设计也得保持$。',
            answer: '童心'
        },
        {
            desc: '平衡是先打设计的主要手段之一，由形的对称转化为$。',
            answer: '力的对称'
        },
        {
            desc: '期刊在封面的艺术处理上主要考虑的是期刊的$。',
            answer: '名称'
        },
        {
            desc: '书籍设计中文字、图形，垂直和倾斜的排列，多被利用来进行$。',
            answer: '平衡的设计'
        },
        {
            desc: '通常将幅面为787×1092mm的全张纸称$。',
            answer: '正度纸'
        },
        {
            desc: '包背装用一张厚纸或绢帛作为$。',
            answer: '封皮'
        },
        {
            desc: '中国引进西方书籍装订技术前，唯一借鉴外国书籍装帧形式的是$。',
            answer: '梵夹装'
        },
        {
            desc: '诗歌的开本一般为长形，根据句子的长度决定版心的$。',
            answer: '尺寸'
        },
        {
            desc: '语言受$和时间的限制。',
            answer: '空间'
        },
        {
            desc: '卷轴装的书籍形态在经过旋风装和经折装后逐渐向$演变。',
            answer: '册页装'
        },
        {
            desc: '精品书的外延形式一定要符合书的气质和$。',
            answer: '内容'
        },
        {
            desc: '书籍的最基本材料就是$。',
            answer: '纸张'
        },
        {
            desc: '对儿童来说，他们的构图方式是$的。',
            answer: '平列式'
        },
        {
            desc: '早在一千九百多年前，中国发明了$术。',
            answer: '造纸'
        },
        {
            desc: '木片做成的书称$。',
            answer: '版牍'
        },
        {
            desc: '正文页传递的信息介于文字与形状的$之间。',
            answer: '构成'
        },
        {
            desc: '儿童在绘画中无法正确地区分一些微小的$。',
            answer: '细节'
        },
        {
            desc: '卷轴装的书中，轴是用以旋转$的。',
            answer: '书卷'
        },
    ].map((item) => ({ ...item, chapter: 3, type: BookDecorationQuizType.FillBlack })),

    ...[
        {
            desc: '国际32开本的尺寸为$。',
            answer: '148×210mm'
        },
        {
            desc: '将文字刻或写在事先加工的竹片、木板上的是$。',
            answer: '简牍'
        },
        {
            desc: '简牍是将文字刻或写在事先加工的竹片、$。',
            answer: '木板上'
        },
        {
            desc: '一般32开本的书籍排版都是$。',
            answer: '通栏'
        },
        {
            desc: '包背装与蝴蝶装最大的区别是$。',
            answer: '折页方式'
        },
        {
            desc: '纸的发明与改进，促进了书籍的$。',
            answer: '社会生产'
        },
        {
            desc: '制约书籍艺术插图的是$。',
            answer: '书籍内容'
        },
        {
            desc: '线装书改包背为$。',
            answer: '露背'
        },
        {
            desc: '期刊除极个别的大型合订本可能用精装以外，一般都是平装在$。',
            answer: '100页以内'
        },
        {
            desc: '在书籍中，插图是为了补足和辅助$。',
            answer: '文字的不足'
        },
        {
            desc: '在文字未产生以前，人类发明帮助记忆的方法最富代表性的是$。',
            answer: '绳书'
        },
        {
            desc: '大32开本的尺寸为$。',
            answer: '140×204mm'
        },
        {
            desc: '人眼的视野约为横向较宽的$。',
            answer: '椭圆形'
        },
        {
            desc: '金文指的是殷周以来铸刻在青铜器上的$。',
            answer: '铭文'
        },
        {
            desc: '按一般的阅读习惯，是先看位于文章之首的$，再看正文。',
            answer: '标题'
        },
        {
            desc: '包背装的得名即来自它的独特的装订方式不露$。',
            answer: '书脊'
        },
        {
            desc: '期刊属每隔一段时间连续$的刊物。',
            answer: '出版'
        },
        {
            desc: '大约在一千三百年前，中国发明了$印刷术。',
            answer: '雕版'
        },
        {
            desc: '概念书籍的设计要突破原先传统图书的$。',
            answer: '观念'
        },
        {
            desc: '在殷商和西周早期，人们将$刻写于龟甲兽骨上。',
            answer: '占卜卜辞'
        },
        {
            desc: '版面设计形式是由书籍的$来决定的。',
            answer: '性质'
        },
        {
            desc: '旋风装与卷轴装的区别，只有在$阅读时才得以看到。',
            answer: '展卷'
        },
        {
            desc: '通常把一张按国家标准分切好的平板原纸称为$纸。',
            answer: '全开'
        },
        {
            desc: '卷轴装是书籍形态的一大进步，但长卷的$仍不尽如人意。',
            answer: '查阅'
        },
    ].map((item) => ({ ...item, chapter: 4, type: BookDecorationQuizType.FillBlack })),

    ...[
        {
            desc: '在成人眼中，任何物体都有透视性$。',
            answer: '近大远小'
        },
        {
            desc: '专业性强的期刊，其设计要体现出$。',
            answer: '书卷气'
        },
        {
            desc: '与蝴蝶装的折页方式完全相反的装订形式是$',
            answer: '包背装'
        },
        {
            desc: 'CD-ROM是一种在电脑上使用的$。',
            answer: '光盘'
        },
        {
            desc: '线装书在折页方面与包背装没有差异，背面相对，$。',
            answer: '版心朝外'
        },
        {
            desc: '色彩在书籍设计中称作第一$。',
            answer: '视觉语言'
        },
        {
            desc: '摄影画册的版心设计甚至可以将图片撑满版面或贴切边作$。',
            answer: '出血版'
        },
        {
            desc: '书籍出版前期，一半是文字内容的编辑工作，另一半是书籍的$。',
            answer: '设计工作'
        },
        {
            desc: '包背装在南宋时期广泛应用完全取代$。',
            answer: '蝴蝶装'
        },
        {
            desc: '尺寸140mm×204mm的为$',
            answer: '大32开本'
        },
        {
            desc: '文字的排版，更适应人眼生理机能的是$。',
            answer: '横排'
        },
        {
            desc: '秩序的形成来源于自然界万物周而复始的$。',
            answer: '重叠'
        },
        {
            desc: '图形、文字水平方向的设计容易造成$。',
            answer: '对称构图'
        },
        {
            desc: '旋风装展开时所有书页$。',
            answer: '向右翻'
        },
        {
            desc: '精装书中，方背精装与$精装基本相似。',
            answer: '圆背'
        },
        {
            desc: '科技类书籍的初级读物主要是$类读物。',
            answer: '科普'
        },
        {
            desc: '印刷术的发明，使$书籍有了发展的空间。',
            answer: '印本'
        },
        {
            desc: '书籍的版面要经过$才能产生新的面貌。',
            answer: '设计'
        },
        {
            desc: '平订，即$平订。',
            answer: '铁丝'
        },
        {
            desc: '在殷商和西周早期，人们将重要历史事件记录在青铜$上。',
            answer: '石鼓'
        },
        {
            desc: '护封使用最广泛的是$克以上的铜版纸和哑粉纸。',
            answer: '157'
        },
        {
            desc: '格式塔心理学是现代欧美$心理学派。',
            answer: '完形'
        },
        {
            desc: '在文字未产生以前，人类发明帮助记忆的方法中最富有代表性的是$。',
            answer: '结绳'
        },
        {
            desc: '一部优秀的书籍作品诞生是美术编辑、$、作者共同创造的结果。',
            answer: '责任编辑'
        },
    ].map((item) => ({ ...item, chapter: 5, type: BookDecorationQuizType.FillBlack })),
].map((quiz, index) => ({
    ...quiz,
    id: index + 1
}))
