export interface Noun {
    title: string;
    explanation: string;
    id: number;
}

export const nouns: Noun[] = [
    {
        title: '卷筒纸',
        explanation: '是将宽度分别为787mm或880mm不同规格，数千米长的纸，卷成圆筒形。均以吨为计量单位，一般适用于高速轮机印刷的报纸和杂志。'
    },
    {
        title: '文学艺术类期刊',
        explanation: '包括小说、报告文学、诗歌、散文、电影、电视、舞蹈、音乐、戏剧、戏曲、绘画、设计、摄影等。'
    },
    {
        title: '无线胶装',
        explanation: '是将经折页、配帖成册的书芯，用不同加工手段，将书籍折缝割开或打毛，施胶将书页粘牢，再包上封面。与传统的包背装非常相似。'
    },
    {
        title: '独幅插图',
        explanation: '即展开书籍时一面为文字，一面为插图，插图独占一版，与文字形成对应的格式。这种版面设计的关键在于文字与插图的均衡关系，因文字版是按版心统一编排的，所以插图的大小及位置所在，均以版心尺寸来定，以视觉舒适，空间搭配合理为佳。'
    },
    {
        title: '韦编',
        explanation: '用皮绳编的简策装叫韦编'
    },
    {
        title: '帙',
        explanation: '汉代的卷轴，外面用布包裹，这个包布称为帙。古书的一帙，一般为五卷或十卷。'
    },
    {
        title: '书籍的雏形',
        explanation: '在殷商和西周早期，人们将占卜卜辞刻写于龟甲兽骨上，重要历史事件记录在青铜石鼓上。称这些文字记录为书籍的雏形。'
    },
    {
        title: '精装',
        explanation: '是一种外来形式，主要应用于经典、专著、工具书、画册等。其结构与平装书的主要区别是硬质的封面或外层加护封，有的甚至还要加函套。'
    },
    {
        title: '活页装',
        explanation: '是各单页之间不粘连的装订方法。一般用于日历、照相册等。'
    },
    {
        title: '甲古文',
        explanation: '以象形文字为基础，初步具备了汉字的基本构造特征，是我国目前见到的最早的能较完整记录语言的文字，盛行于殷商，刻写于龟甲兽骨上，用于占卜、祭祀等活动。'
    },
    {
        title: '标题',
        explanation: '位于文章之首，按一般的阅读习惯，是先看位于文章之首的标题，再看正文。标题几个字的份量，也可以说是这段正文内容的总结，所以应把标题设计得具有个性。'
    },
    {
        title: '丝编',
        explanation: '用丝绳编的简策装叫丝编。'
    },
    {
        title: '平订',
        explanation: '即铁丝平订。是将印好的书页经折页、配帖成册后，在订口一边用铁丝订牢，再包上封面的装订方法。用于一般书籍的装订。'
    },
    {
        title: '书卷气',
        explanation: '指存在于书籍艺术之中的深刻内涵、高雅气质、艺术品位。'
    },
    {
        title: '圆背精装',
        explanation: '是将精装书封面的书背处理成圆弧形的装订形式。这种装订方式，可使整本书的书帖都能展开，便于翻阅。'
    },
    {
        title: '骑马订',
        explanation: '是将印号的书页连同封面，在折页中间用铁丝钉牢的装订方法。这种方法，使书页摊平，便于翻阅，用于杂志和一般较薄书籍装订。'
    },
    {
        title: '社会科学类期刊',
        explanation: '包括政治学、经济学、法学、教育学、文艺学、史学、语言学、民族学、宗教学、社会学等。'
    },
    {
        title: '经折装',
        explanation: '是佛教徒受印度经书的启示对卷轴进行的革新，他们将长长的书页沿书文版面的间隙，均匀地一反一正折叠，形成长方形的一叠，首末二页各加以硬纸的装订形式，正反面都可印上文字，这种书籍的形态为人们的阅读提供了方便。这种装订形式已完全脱离卷轴。从外形上看，它近似于后来的册页书籍。是卷轴装向册页过渡的中间形式。'
    },
    {
        title: '全开纸',
        explanation: '通常把一张按国家标准分切好的平板原纸称为全开纸。'
    },
    {
        title: '金文 ',
        explanation: '指殷周以来铸刻在青铜器上的铭文。金文是先秦书法的主要内容，从笔画到结构都与殷商的甲古文相近，两者合称甲金文。'
    },
    {
        title: '梵夹装',
        explanation: '十九世纪中国引进西方装订技术之前，梵夹装是中国书籍艺术中唯一借鉴外国书籍装帧的形式。印度的梵夹装是将修长的贝多树叶加工后写上经文依序排好，用两块竹板或木板上下夹住，然后连板带经穿一个或两个洞，穿绳绕捆。这样既可以把书页连在一起，又可使经文免于受损。'
    },
    {
        title: '自然科学类期刊',
        explanation: '包括数学、物理学、化学、天文学、气象学、海洋学、地质学、生物学等基础科学及农业科学、医学科学、材料科学、能源科学等应用技术科学。'
    },
    {
        title: '帛书',
        explanation: '在简策大兴的同时，有钱人取质地轻薄柔软的丝织品帛来作为书写的材料，称为帛书。'
    },
    {
        title: '软面精装',
        explanation: '是为减轻书籍重量和方便阅读，把硬面改成软面，即用较薄的纸板代替一般精装书上较厚的纸板。'
    },
    {
        title: '绳书',
        explanation: '在文字未产生以前，人类发明帮助记忆的方法。以结绳的大小、松紧、多寡及涂上不同颜色等，方式，来表示各种不同的意义。'
    },
    {
        title: '版牍',
        explanation: '木片做成的书称版牍。'
    },
    {
        title: '文字画',
        explanation: '在文字未产生以前，一种图形符号逐渐取代绳书，这种图形已有文字的雏形，一般称为文字画。'
    },
    {
        title: '贝页经',
        explanation: '意即用贝多树叶书写的佛经，特指书写的材料以及经文的特质。'
    },
    {
        title: '开本',
        explanation: '是指一本书的幅面大小。开本可称书籍的第一形象，也是书籍的外部造型，是指一本书的体态、幅面大小。'
    },
    {
        title: '简牍',
        explanation: '竹片做成的书称作简策，木片做成的书称版牍，人们习惯把这两种书的形态统称简牍。'
    },
].map((noun, index) => ({ ...noun, id: index + 1 }));

export function getShuffleNouns(): Noun[] {
    return nouns.sort((a, b) => Math.random() > 0.5 ? a.id - b.id : b.id - a.id);
}
