export interface ShortAnswer {
    desc: string;
    answers: string[];
    id: number;
}

export const shortAnswers: ShortAnswer[] = [
    {
        desc: '简述书籍设计中的书脊内容名称',
        answers: [
            '书名',
            '作者名',
            '出版社名称'
        ]
    },
    {
        desc: '简述书籍设计的三大属性',
        answers: [
            '独立性',
            '工艺性',
            '从属性'
        ]
    },
    {
        desc: '简述书籍的版面设计内容',
        answers: [
            '将文字、图形这些有限的视觉元素根据特定内容的需要，进行有机的排列组织安排在一定的版面上',
            '包括版心、天头、地脚、书口、订口的空白',
            '是一种具有个人风格和艺术特色的视觉传达方式'
        ]
    },
    {
        desc: '简述内封的设计风格',
        answers: [
            '从设计风格上说，内封的设计更趋于简洁',
            '图形色彩更趋于单纯',
            '一般采用在原材料上进行烫压工艺来表现'
        ]
    },
    {
        desc: '简述版心四周空白处内容',
        answers: [
            '天头',
            '地脚',
            '书口',
            '订口'
        ]
    },
    {
        desc: '简述概念书籍的设计要求',
        answers: [
            '内容和形式的结合',
            '保持阅读的功能',
            '能只追求外表的形态表现'
        ]
    },
    {
        desc: '简述书籍正文包括的内容',
        answers: [
            '前言',
            '正文',
            '序言',
            '主题部目录',
            '后记'
        ]
    },
    {
        desc: '简述内封的形式',
        answers: [
            '内封分软内封和硬内封两种形式',
            '精装书的硬式内封本身是硬纸板，外面用特种纸、织物或皮革裱糊',
            '软式内封则由具有韧性的白板纸、卡纸等制作'
        ]
    },
    {
        desc: '简述中国传统书籍排式特点',
        answers: [
            '中国传统书籍大都采用的是直排式',
            '这主要是沿袭中国最早的书籍简牍从上而下，从右至左的排列方法',
            '不过这种竖排式方法不太符合人眼睛的生理结构'
        ]
    },
    {
        desc: '简述函套在设计中考虑的方面',
        answers: [
            '材料的表现',
            '结构的合理',
            '与内容的协调'
        ]
    },
    {
        desc: '简述平装书的装订方式',
        answers: [
            '骑马订',
            '丝线订',
            '胶粘',
            '铁丝订',
            '穿线装'
        ]
    },
    {
        desc: '简述精装书的装订方式',
        answers: [
            '软面精装',
            '圆背精装',
            '方背精装'
        ]
    },
    {
        desc: '简述护封的内容',
        answers: [
            '封面',
            '封底',
            '前勒口',
            '后勒口',
            '书脊'
        ]
    },
    {
        desc: '简述科技类书籍阅读对象的分类',
        answers: [
            '科技类书籍的阅读对象广，按不同的文化层次，又可分为初级、中级和高级',
            '初级读物主要是科普类读物，适合中等文化以下的读者',
            '中级读物属应用科学书籍，适合中级工程人员、大专院校学生',
            '高级读物属专业理论书籍，适合大学教师、研究生、高级技术人员'
        ]
    },
    {
        desc: '简述书籍设计的独立性主要表现方面',
        answers: [
            '立体性',
            '四维性',
            '编辑性',
            '广告性',
            '书卷气'
        ]
    },
    {
        desc: '简述书籍设计的立意方法',
        answers: [
            '概括书的内容',
            '发挥想象力',
            '寻找趣味',
            '创新方法'
        ]
    },
    {
        desc: '简述标题的特点',
        answers: [
            '标题位于文章之首，按一般的阅读习惯，是先看标题，再看正文',
            '标题几个字的份量，可以说是这段正文内容的总结，所以应把标题设计得具有个性',
            '根据书的内容，选用合适的字体，可以很好地反映书的性格',
            '排列方式又形成了标题的纵横变化，使得标题的形态更具有多变性'
        ]
    },
    {
        desc: '简述科技书籍设计作品创作过程',
        answers: [
            '从书中内涵提取元素',
            '发挥想象',
            '概括归纳'
        ]
    },
    {
        desc: '简述书籍护封的文字内容',
        answers: [
            '书名',
            '出版社名',
            '作者名',
            '为增加广告性而设的提示语'
        ]
    },
    {
        desc: '简述期刊的表现手法',
        answers: [
            '文字为主',
            '照片表现',
            '风趣夸张',
            '插图组合'
        ]
    },
    {
        desc: '简述现代书装主要形式',
        answers: [
            '平装',
            '精装',
            '多媒体光盘'
        ]
    },
    {
        desc: '简述护封中实现设计者创意的内容',
        answers: [
            '文字',
            '色彩',
            '图形',
            '材料',
            '工艺'
        ]
    },
    {
        desc: '简述版面设计要求重视的内容',
        answers: [
            '版面的易读性',
            '内容的可读性',
            '插图的可视性'
        ]
    },
    {
        desc: '简述书籍版面的三大支柱',
        answers: [
            '正文',
            '页码',
            '标题'
        ]
    },
].map((shortAnswer, index) => ({ ...shortAnswer, id: index + 1 }));

export function getShuffleShortAnswers(): ShortAnswer[] {
    return shortAnswers.sort((a, b) => Math.random() > 0.5 ? a.id - b.id : b.id - a.id);
}
